// -створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//
// let number = [21, 22, 23, 24, 25];
// console.log(number);
// let fruits = ['Яблоко', 'Апельсин', 'Слива', 'Банан', 'Груша'];
// console.log(fruits);
// let students = [
//     {name: 'vasya', age: 18, stipend: false},
//     {name: 'petya', age: 19, stipend: true},
//     {name: 'kolya', age: 21, stipend: true},
//     {name: 'olya', age: 20, stipend: false},
//     {name: 'max', age: 17, stipend: true}
// ];
// console.log(students);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу.
// Вивести в консоль

// let array = [];
// array[0] = 20;
// array[1] = 21;
// array[2] = 22;
// array[3] = 23;
// array[4] = 24;
// array[5] = 25;
// console.log(array);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

for (let i = 0; i < 10; i++) {
    let element = i;
    document.write('<div>Lorem ipsum.</div>');
}

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

for (let i = 0; i < 10; i++) {
    document.write('<div>Lorem ' + (i) + ' ipsum.</div>');
}

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

let i = 0;
while (  i <= 19 ) {
    document.write('<h1>Lorem ipsum dolor.</h1>');
    i++;
}

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

let p = 0;
while (  p <= 19 ) {
    document.write('<h1>Lorem ' + (p) + ' ipsum.</h1>');
    p++;
}

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи













// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write